# BuiltInFailures.EditingFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures Class
BuiltInFailures Class Members See Also
---
Failures related to editing operations.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class EditingFailures
```

Visual Basic
---
```text
Public NotInheritable Class EditingFailures
```

Visual C++
---
```text
public ref class EditingFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..EditingFailures
# See Also
BuiltInFailures..::..EditingFailures Members
Autodesk.Revit.DB Namespace